9/data/attachments/f6935d5981e05727.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ab958f1b-5b02-4dd2-8fc6-421991f2fb8a</nif:username>
            <nif:friendToBeAdded>Melissa_open_Friend_3131_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>